## Project 1: Creating Databases and Operations

In [1]:
# Import the mysql.connector library
import mysql.connector

In [2]:
# Connect to the MySQL server with provided credentials
mydb = mysql.connector.connect(
    host='localhost',      # Specify the host (in this case, localhost)
    user='root',           # Specify the MySQL user (in this case, root)
    password='Mmbsaksd7736@'  # Specify the password for the user
)

# Create a cursor to interact with the MySQL server
mycursor = mydb.cursor()

# Execute the SQL query to create a new database named 'class'
mycursor.execute('CREATE DATABASE class')

# Close the connection to the MySQL server
mydb.close()

In [3]:
# Connect to the MySQL server with provided credentials and select the 'class' database
mydb = mysql.connector.connect(
    host='localhost',      # Specify the host (in this case, localhost)
    user='root',           # Specify the MySQL user (in this case, root)
    password='Mmbsaksd7736@',  # Specify the password for the user
    database='class'       # Specify the database to connect to (in this case, 'class')
)

# Create a cursor to interact with the 'class' database
mycursor = mydb.cursor()

In [4]:
# SQL query to create the 'student' table
query1 = '''CREATE TABLE student(
    std_id INT PRIMARY KEY,
    name VARCHAR(20),
    assignment1 INT NOT NULL,
    assignment2 INT NOT NULL,
    assignment3 INT NOT NULL,
    assignment4 INT NOT NULL,
    assignment5 INT NOT NULL
)'''

# Execute the CREATE TABLE query
mycursor.execute(query1)

In [5]:
# Execute the 'SHOW TABLES' query to retrieve the list of tables in the 'class' database
mycursor.execute('SHOW TABLES')

# Iterate through the result set and print each table
for table in mycursor:
    print(table)

('student',)

In [6]:
# SQL query to insert data into the 'student' table
query2 = "INSERT INTO student(std_id, name, assignment1, assignment2, assignment3, assignment4, assignment5) VALUES(%s, %s, %s, %s, %s, %s, %s)"

# List of values to insert into the 'student' table
val2 = [
    (1, 'John Doe', 85, 92, 78, 90, 88),
    (2, 'Jane Smith', 77, 88, 95, 82, 79),
    (3, 'Bob Johnson', 90, 85, 88, 92, 87),
    (4, 'Alice Williams', 92, 78, 94, 86, 90),
    (5, 'Charlie Brown', 85, 90, 76, 88, 94),
    (6, 'Eva Davis', 88, 94, 85, 80, 92)
]

# Execute the INSERT query with multiple values
mycursor.executemany(query2, val2)

In [7]:
# SQL query to select all rows from the 'student' table
query3 = "SELECT * FROM student"

# Execute the SELECT query
mycursor.execute(query3)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(1, 'John Doe', 85, 92, 78, 90, 88)
(2, 'Jane Smith', 77, 88, 95, 82, 79)
(3, 'Bob Johnson', 90, 85, 88, 92, 87)
(4, 'Alice Williams', 92, 78, 94, 86, 90)
(5, 'Charlie Brown', 85, 90, 76, 88, 94)
(6, 'Eva Davis', 88, 94, 85, 80, 92)

In [8]:
# SQL query to calculate total marks for each student and select the student with the highest total
query4 = '''SELECT std_id,
                    name, 
                    assignment1 + assignment2 + assignment3 + assignment4 + assignment5 AS total 
             FROM student
             ORDER BY total DESC 
             LIMIT 1'''

# Execute the SELECT query
mycursor.execute(query4)

# Iterate through the result set and print the student with the highest total marks
for row in mycursor:
    print(row)

(3, 'Bob Johnson', 442)

In [9]:
# Commit the changes to the database
mydb.commit()

# Close the connection to the MySQL server
mydb.close()

## Project 2: Handling Databases and CRUD operations using Python

In [10]:
# Connect to the MySQL server with provided credentials
mydb = mysql.connector.connect(
    host='localhost',      # Specify the host (in this case, localhost)
    user='root',           # Specify the MySQL user (in this case, root)
    password='Mmbsaksd7736@'  # Specify the password for the user
)

# Create a cursor to interact with the MySQL server
mycursor = mydb.cursor()

# Execute the SQL query to create a new database named 'project_2'
mycursor.execute('CREATE DATABASE project_2')

# Close the connection to the MySQL server
mydb.close()

In [11]:
# Connect to the MySQL server with provided credentials and select the 'project_2' database
mydb = mysql.connector.connect(
    host='localhost',      # Specify the host (in this case, localhost)
    user='root',           # Specify the MySQL user (in this case, root)
    password='Mmbsaksd7736@',  # Specify the password for the user
    database='project_2'    # Specify the database to connect to (in this case, 'project_2')
)

# Create a cursor to interact with the 'project_2' database
mycursor = mydb.cursor()

In [12]:
# SQL query to create the 'employee' table
query5 = '''CREATE TABLE employee(
    emp_id INT NOT NULL,
    name VARCHAR(20) NOT NULL,
    gender VARCHAR(10) NOT NULL,
    age INT NOT NULL,
    salary INT NOT NULL
)'''

# Execute the CREATE TABLE query
mycursor.execute(query5)

In [13]:
# Execute the 'SHOW TABLES' query to retrieve the list of tables in the 'project_2' database
mycursor.execute('SHOW TABLES')

# Iterate through the result set and print each table
for table in mycursor:
    print(table)

('employee',)

In [14]:
# SQL query to insert data into the 'employee' table
query6 = "INSERT INTO employee(emp_id, name, gender, age, salary) VALUES (%s, %s, %s, %s, %s)"

# List of values to insert into the 'employee' table
val6 = [
    (1, 'John Doe', 'Male', 25, 50000),
    (2, 'Jane Smith', 'Female', 30, 60000),
    (3, 'Bob Johnson', 'Male', 28, 55000),
    (4, 'Emily Davis', 'Female', 35, 70000),
    (5, 'Michael Williams', 'Male', 32, 65000),
    (6, 'Sarah Wilson', 'Female', 29, 60000)
]

# Execute the INSERT query with multiple values
mycursor.executemany(query6, val6)

In [15]:
# SQL query to select all rows from the 'employee' table
query7 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query7)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(1, 'John Doe', 'Male', 25, 50000)
(2, 'Jane Smith', 'Female', 30, 60000)
(3, 'Bob Johnson', 'Male', 28, 55000)
(4, 'Emily Davis', 'Female', 35, 70000)
(5, 'Michael Williams', 'Male', 32, 65000)
(6, 'Sarah Wilson', 'Female', 29, 60000)

In [16]:
# SQL query to update salary for female employees
query8 = "UPDATE employee SET salary = salary * 1.1 WHERE gender = 'Female'"

# Execute the UPDATE query
mycursor.execute(query8)

# SQL query to select all rows from the 'employee' table
query7 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query7)

# Iterate through the result set and print each updated row
for row in mycursor:
    print(row)

(1, 'John Doe', 'Male', 25, 50000)
(2, 'Jane Smith', 'Female', 30, 66000)
(3, 'Bob Johnson', 'Male', 28, 55000)
(4, 'Emily Davis', 'Female', 35, 77000)
(5, 'Michael Williams', 'Male', 32, 65000)
(6, 'Sarah Wilson', 'Female', 29, 66000)

In [17]:
# SQL query to delete rows from the 'employee' table where salary is between 51000 and 76000
query9 = "DELETE FROM employee WHERE salary BETWEEN 51000 AND 76000"

# Execute the DELETE query
mycursor.execute(query9)

# SQL query to select all rows from the 'employee' table
query7 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query7)

# Iterate through the result set and print each remaining row
for row in mycursor:
    print(row)

(1, 'John Doe', 'Male', 25, 50000)
(4, 'Emily Davis', 'Female', 35, 77000)

In [18]:
# SQL query to drop (delete) the 'project_2' database
mycursor.execute('DROP DATABASE project_2')

# SQL query to drop (delete) the 'class' database
mycursor.execute('DROP DATABASE class')

In [19]:
# Commit the changes to the database
mydb.commit()

# Close the connection to the MySQL server
mydb.close()